{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Importing a csv file to a neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"blockchain\"))\n",
    "session = driver.session()\n",
    "# ethereum = pd.read_csv(\"./transactions.csv\", chunksize=1000, iterator=True, sep=\";\")\n",
    "ethereum = [pd.read_csv(\"./transactions.csv\", nrows=100, sep=\";\")]\n",
    "IN_ADDRESS = 'from'\n",
    "OUT_ADDRESS = 'to'\n",
    "AMOUNT = 'value'\n",
    "for chunk in ethereum:\n",
    "    for index, row in chunk.iterrows():\n",
    "        session.run(\"MERGE (address1:Address {address:{address1}})\"\n",
    "                    \"MERGE (address2:Address {address:{address2}})\"\n",
    "                    \"CREATE UNIQUE (address1)-[t:Transactions]->(address2)\"\n",
    "                    \"SET t.amount = coalesce(t.amount, 0) - {amount}\"\n",
    "                    \"SET t.number = coalesce(t.number, 0) - 1\",\n",
    "                    {\"address1\": row[IN_ADDRESS], \"address2\": row[OUT_ADDRESS], 'amount': row[AMOUNT]})\n",
    "session.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Clustering a neo4j graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "```cypher\n",
    "MATCH (start:Address{address: \"0x32be343b94f860124dc4fee278fdcbd38c102d88\"})-[:Transaction*1..2]->(address:Address) RETURN address\n",
    "\n",
    "//Find all connected components\n",
    "CALL algo.unionFind('Address', 'Transactions', {write:true, partitionProperty:\"component\"})\n",
    "YIELD nodes, setCount, loadMillis, computeMillis, writeMillis\n",
    "\n",
    "//Create minimum spanning tree\n",
    "//TODO Use connected components only\n",
    "MATCH(a:Address{address: '0x0d4ecc7d750180ebf4a9df728b6669b5bceb5e40'}) \n",
    "CALL algo.mst(a, 'number', {write:true, writeProperty:\"MSTree\"})\n",
    "YIELD loadMillis, computeMillis, writeMillis, weightSum, weightMin, weightMax, relationshipCount\n",
    "RETURN relationshipCount;\n",
    "\n",
    "//Create clusters\n",
    "MATCH ()-[t:MSTree]->() \n",
    "WITH t \n",
    "ORDER BY t.number \n",
    "LIMIT 80 //Number of clusters - number of components - 1\n",
    "DELETE t;\n",
    "\n",
    "//Remove transactions relation\n",
    "MATCH ()-[t:Transactions]->() DELETE t;\n",
    "\n",
    "//Remove addresses\n",
    "MATCH (a:Address) DETACH DELETE a;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Open session"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'GraphDatabase' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-2-17b43c71c348>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mdriver\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGraphDatabase\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdriver\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"bolt://localhost:7687\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mauth\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mbasic_auth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"neo4j\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"blockchain\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0msession\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mdriver\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'GraphDatabase' is not defined"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"blockchain\"))\n",
    "session = driver.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Find connected components"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "session.run(\"CALL algo.unionFind('Address', 'Transactions', {write:true, partitionProperty:'component'}) \"\n",
    "            \"YIELD nodes, setCount, loadMillis, computeMillis, writeMillis \"\n",
    "            \"RETURN nodes;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create minimum spanning tree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f0a2170bbe0>"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH(a:Address{address: '0x0d4ecc7d750180ebf4a9df728b6669b5bceb5e40'}) \"\n",
    "            \"CALL algo.mst(a, 'number', {write:true, writeProperty:'MSTree'}) \"\n",
    "            \"YIELD loadMillis, computeMillis, writeMillis, weightSum, weightMin, weightMax, relationshipCount \"\n",
    "            \"RETURN relationshipCount;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create clusters"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f0a2170b160>"
      ]
     },
     "execution_count": 123,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH ()-[t:MSTree]->() \"\n",
    "            \"WITH t \"\n",
    "            \"ORDER BY t.number DESC \"\n",
    "            \"LIMIT 40 \"\n",
    "            \"DELETE t;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Remove MSTree relation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f0a2180c8d0>"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH ()-[t:MSTree]->() DELETE t;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Remove transactions relation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7f0a218c5e80>"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH ()-[t:Transactions]->() DELETE t;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Remove addresses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "session.run(\"MATCH (a:Address) DETACH DELETE a;\")\n",
    "session.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Clustering using MCL"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1. Get adjacency matrix\n",
    "2. Normalize matrix\n",
    "3. Use MCL to get clusters"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 155,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import numpy as np\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"blockchain\"))\n",
    "session = driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "addresses = session.run(\"MATCH (address:Address) RETURN address\");\n",
    "address_indices = []\n",
    "for address in addresses:\n",
    "    address_indices.append(address['address'].properties['address'])\n",
    "\n",
    "invert_address_indices = {v: k for k, v in enumerate(address_indices)}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "transactions_matrix = np.zeros((len(address_indices), len(address_indices)))\n",
    "transactions = session.run(\"MATCH p=()-[:Transactions]->() RETURN p\")\n",
    "for transaction in transactions.data():\n",
    "    start = invert_address_indices[transaction['p'].start.properties['address']]\n",
    "    end = invert_address_indices[transaction['p'].end.properties['address']]\n",
    "    transactions_matrix[start, end] -= transaction['p'].relationships[0].properties['number']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from mcl.mcl_clustering import mcl\n",
    "\n",
    "M, clusters = mcl(transactions_matrix, \n",
    "                   expand_factor = 10,\n",
    "                   inflate_factor = 0.1,\n",
    "                   max_loop = 1000,\n",
    "                   mult_factor = 10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 159,
   "metadata": {
    "collapsed": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "28\n",
      "44\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "9\n",
      "10\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "11\n",
      "12\n",
      "14\n",
      "15\n",
      "30\n",
      "15\n",
      "30\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "10\n",
      "13\n",
      "16\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "17\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "18\n",
      "19\n",
      "19\n",
      "6\n",
      "20\n",
      "12\n",
      "21\n",
      "6\n",
      "22\n",
      "23\n",
      "6\n",
      "23\n",
      "24\n",
      "25\n",
      "25\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "26\n",
      "27\n",
      "31\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "4\n",
      "27\n",
      "54\n",
      "71\n",
      "72\n",
      "8\n",
      "28\n",
      "29\n",
      "44\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "31\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "8\n",
      "28\n",
      "32\n",
      "44\n",
      "8\n",
      "28\n",
      "33\n",
      "44\n",
      "36\n",
      "37\n",
      "37\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "38\n",
      "39\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "39\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "30\n",
      "40\n",
      "41\n",
      "30\n",
      "41\n",
      "42\n",
      "43\n",
      "42\n",
      "43\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "46\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "6\n",
      "47\n",
      "6\n",
      "48\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "46\n",
      "49\n",
      "50\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "51\n",
      "52\n",
      "52\n",
      "53\n",
      "6\n",
      "56\n",
      "6\n",
      "57\n",
      "8\n",
      "28\n",
      "44\n",
      "58\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "59\n",
      "60\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "60\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "61\n",
      "62\n",
      "62\n",
      "12\n",
      "63\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "64\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "65\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "30\n",
      "66\n",
      "67\n",
      "30\n",
      "67\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "69\n",
      "70\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "70\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "74\n",
      "75\n",
      "78\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "75\n",
      "78\n",
      "76\n",
      "77\n",
      "77\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "79\n",
      "80\n",
      "0\n",
      "1\n",
      "3\n",
      "4\n",
      "13\n",
      "34\n",
      "35\n",
      "45\n",
      "49\n",
      "54\n",
      "55\n",
      "68\n",
      "71\n",
      "72\n",
      "73\n",
      "78\n",
      "80\n",
      "81\n",
      "82\n",
      "82\n",
      "6\n",
      "83\n",
      "84\n",
      "85\n",
      "85\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{0: [0, 1, 2, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 1: [5, 6],\n",
       " 2: [7, 8, 28, 44],\n",
       " 3: [0, 1, 3, 4, 9, 10, 13, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 4: [11, 12],\n",
       " 5: [14, 15, 30],\n",
       " 6: [15, 30],\n",
       " 7: [0, 1, 3, 4, 10, 13, 16, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 8: [0, 1, 3, 4, 13, 17, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 9: [18, 19],\n",
       " 10: [19],\n",
       " 11: [6, 20],\n",
       " 12: [12, 21],\n",
       " 13: [6, 22, 23],\n",
       " 14: [6, 23],\n",
       " 15: [24, 25],\n",
       " 16: [25],\n",
       " 17: [0, 1, 3, 4, 13, 26, 27, 31, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 18: [0, 1, 4, 27, 54, 71, 72],\n",
       " 19: [8, 28, 29, 44],\n",
       " 20: [0, 1, 3, 4, 13, 31, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 21: [8, 28, 32, 44],\n",
       " 22: [8, 28, 33, 44],\n",
       " 23: [36, 37],\n",
       " 24: [37],\n",
       " 25: [0, 1, 3, 4, 13, 34, 35, 38, 39, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 26: [0, 1, 3, 4, 13, 34, 35, 39, 45, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 27: [30, 40, 41],\n",
       " 28: [30, 41],\n",
       " 29: [42, 43],\n",
       " 30: [42, 43],\n",
       " 31: [0, 1, 3, 4, 13, 34, 35, 45, 46, 49, 54, 55, 68, 71, 72, 73, 78],\n",
       " 32: [6, 47],\n",
       " 33: [6, 48],\n",
       " 34: [0, 1, 3, 4, 13, 34, 35, 45, 46, 49, 50, 54, 55, 68, 71, 72, 73, 78],\n",
       " 35: [51, 52],\n",
       " 36: [52, 53],\n",
       " 37: [6, 56],\n",
       " 38: [6, 57],\n",
       " 39: [8, 28, 44, 58],\n",
       " 40: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 59, 60, 68, 71, 72, 73, 78],\n",
       " 41: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 60, 68, 71, 72, 73, 78],\n",
       " 42: [61, 62],\n",
       " 43: [62],\n",
       " 44: [12, 63],\n",
       " 45: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 64, 68, 71, 72, 73, 78],\n",
       " 46: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 65, 68, 71, 72, 73, 78],\n",
       " 47: [30, 66, 67],\n",
       " 48: [30, 67],\n",
       " 49: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 69, 70, 71, 72, 73, 78],\n",
       " 50: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 70, 71, 72, 73, 78],\n",
       " 51: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 74, 75, 78],\n",
       " 52: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 75, 78],\n",
       " 53: [76, 77],\n",
       " 54: [77],\n",
       " 55: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78, 79, 80],\n",
       " 56: [0, 1, 3, 4, 13, 34, 35, 45, 49, 54, 55, 68, 71, 72, 73, 78, 80],\n",
       " 57: [81, 82],\n",
       " 58: [82],\n",
       " 59: [6, 83],\n",
       " 60: [84, 85],\n",
       " 61: [85]}"
      ]
     },
     "execution_count": 159,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = []\n",
    "for index, cluster in clusters.items():\n",
    "    for address in cluster:\n",
    "        print(address)\n",
    "        address = address_indices[address]\n",
    "        session.run(\"MATCH (a:Address{address: {address}}) WITH a \"\n",
    "                   \"SET a.cluster = coalesce(a.cluster, {cluster})\", \n",
    "                    {'address': address, 'cluster': index})\n",
    "clusters"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Greedy clustering"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```cypher\n",
    "// Convert amount\n",
    "\n",
    "MATCH (a:Address)-[t:Transaction]->(b:Address)\n",
    "WITH t\n",
    "SET t.amount = toFloat(t.amount)\n",
    "\n",
    "// Reset properties\n",
    "\n",
    "MATCH (a:Address) \n",
    "SET a.all = 0.0\n",
    "SET a.rotate = 0.0\n",
    "SET a.cluster = 0;\n",
    "\n",
    "// Initialize sum of all transactions for an address\n",
    "\n",
    "MATCH (a:Address)-[t:Transaction]-(b:Address) WITH t, a, b\n",
    "SET a.all = a.all + t.amount\n",
    "\n",
    "// Set start\n",
    "\n",
    "MATCH (start:Address{address: '0x22a0fbf89ad1362d74f626436d8c4fc6dc4f0679'}) SET start.cluster = 1;\n",
    "\n",
    "// Iteration: reset rotate for candidates\n",
    "\n",
    "MATCH (:Address{cluster: 1})-[transaction:Transaction]-(candidate:Address) WHERE candidate.cluster <> 1 WITH candidate\n",
    "SET candidate.rotate = 0.0;\n",
    "\n",
    "// Iteration: recount rotate and all coefficients for each candidate vertex\n",
    "\n",
    "MATCH (:Address{cluster: 1})-[transaction:Transaction]-(candidate:Address) WHERE candidate.cluster <> 1 WITH candidate, transaction\n",
    "SET candidate.rotate = candidate.rotate + transaction.amount;\n",
    "\n",
    "// Iteration: add best node to a cluster and recount cluster params\n",
    "\n",
    "MATCH (start:Address{address: '0x22a0fbf89ad1362d74f626436d8c4fc6dc4f0679'}) WITH start\n",
    "MATCH (:Address{cluster: 1})-[t:Transaction]-(candidate:Address) WHERE candidate.cluster <> 1 WITH ((start.rotate + candidate.rotate) / (start.all + candidate.all - candidate.rotate)) AS rotate_all, candidate, start ORDER BY rotate_all DESC LIMIT 1 \n",
    "SET candidate.cluster = 1\n",
    "SET start.all = start.all + candidate.all\n",
    "SET start.rotate = start.rotate + candidate.rotate - candidate.rotate\n",
    "SET start.rotate_all = rotate_all;\n",
    "\n",
    "// Return all nodes\n",
    "\n",
    "MATCH p=(:Address{cluster: 1})-[:Transaction]-(:Address) RETURN p LIMIT 50;\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"blockchain\"))\n",
    "session = driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.v1.result.BoltStatementResult at 0x7fa45a8bf4a8>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH (a:Address)\" \n",
    "            \"SET a.all = 0 \"\n",
    "            \"SET a.rotate = 0 \"\n",
    "            \"SET a.cluster = 0;\", {})\n",
    "session.run(\"MATCH (a:Address)-[t:Transaction]-(b:Address) WITH t, a, b \"\n",
    "            \"SET a.all = coalesce(a.all, 0) + t.amount\", {})\n",
    "session.run(\"MATCH (start:Address{address: {address}}) SET start.cluster = 1;\", {'address': '0x32be343b94f860124dc4fee278fdcbd38c102d88'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n",
      "12\n",
      "13\n",
      "14\n",
      "15\n",
      "16\n",
      "17\n",
      "18\n",
      "19\n",
      "20\n",
      "21\n",
      "22\n",
      "23\n",
      "24\n",
      "25\n",
      "26\n",
      "27\n",
      "28\n",
      "29\n",
      "30\n",
      "31\n",
      "32\n",
      "33\n",
      "34\n",
      "35\n",
      "36\n",
      "37\n",
      "38\n",
      "39\n",
      "40\n",
      "41\n",
      "42\n",
      "43\n",
      "44\n",
      "45\n",
      "46\n",
      "47\n",
      "48\n",
      "49\n",
      "50\n",
      "51\n",
      "52\n",
      "53\n",
      "54\n",
      "55\n",
      "56\n",
      "57\n",
      "58\n",
      "59\n",
      "60\n",
      "61\n",
      "62\n",
      "63\n",
      "64\n",
      "65\n",
      "66\n",
      "67\n",
      "68\n",
      "69\n",
      "70\n",
      "71\n",
      "72\n",
      "73\n",
      "74\n",
      "75\n",
      "76\n",
      "77\n",
      "78\n",
      "79\n",
      "80\n",
      "81\n",
      "82\n",
      "83\n",
      "84\n",
      "85\n",
      "86\n",
      "87\n",
      "88\n",
      "89\n",
      "90\n",
      "91\n",
      "92\n",
      "93\n",
      "94\n",
      "95\n",
      "96\n",
      "97\n",
      "98\n",
      "99\n"
     ]
    }
   ],
   "source": [
    "for i in range(0, 100):\n",
    "    print(i)\n",
    "    session.run(\"MATCH (:Address{cluster: 1})-[transaction:Transaction]-(candidate:Address) WHERE candidate.cluster <> 1 WITH candidate \"\n",
    "                \"SET candidate.rotate = 0.0;\", {})\n",
    "    session.run(\"MATCH (:Address{cluster: 1})-[transaction:Transaction]-(candidate:Address) WHERE candidate.cluster <> 1 WITH candidate, transaction \"\n",
    "                \"SET candidate.rotate = coalesce(candidate.rotate, 0) + transaction.amount\", {})\n",
    "    session.run(\"MATCH (start:Address{address: {address}}) WITH start \"\n",
    "                \"MATCH (:Address{cluster: 1})-[t:Transaction]-(candidate:Address) WHERE candidate.cluster <> 1 WITH ((start.rotate + candidate.rotate) / (start.all + candidate.all - candidate.rotate)) AS rotate_all, candidate, start ORDER BY rotate_all DESC LIMIT 1 \"\n",
    "                \"SET candidate.cluster = 1 \"\n",
    "                \"SET start.all = coalesce(start.all, 0) + candidate.all - candidate.rotate \"\n",
    "                \"SET start.rotate = coalesce(start.rotate, 0) + candidate.rotate;\", {'address': '0x32be343b94f860124dc4fee278fdcbd38c102d88'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "session.close();"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
